0xtanzim.filetree-pro
1yib.rust-bundle
adpyke.codesnap
antaalt.shader-validator
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dustypomerleau.rust-syntax
eamodio.gitlens
esbenp.prettier-vscode
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot-chat
golang.go
kisstkondoros.vscode-gutter-preview
leonardssh.vscord
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.powershell
openai.chatgpt
pkief.material-icon-theme
qwtel.sqlite-viewer
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
tal7aouy.rainbow-bracket
tauri-apps.tauri-vscode
usernamehw.errorlens
venner.vscode-glua-enhanced
vue.volar
zhuangtongfa.material-theme
